ga_project_1/app/views/swimwear/index.html.erb


<p><%= @products.first.product_name %></p>
---
SELECT "products".* FROM "products"