app/views/customers/show.html.erb

    <th><%= order.created_at.strftime('%d %B %Y') %></th>
    <th><%= order.products.first.product_name %></th>
---
SELECT  "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  ORDER BY "products"."id" ASC LIMIT 1