app/controllers/application_controller.rb

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" IS NULL LIMIT 1
---
  def authenticate_customer
    @current_customer = Customer.find_by(:id => session[:customer_id])