app/controllers/customers_controller.rb

	def show
		redirect_to login_path unless @current_customer
		@customer = @current_customer
		#define variable that looks up all orders from customer with this id which have status confirmed
		@order_list = @customer.orders.where(:status => "confirmed")
---
SELECT "orders".* FROM "orders"  WHERE "orders"."customer_id" = $1 AND "orders"."status" = 'confirmed'  [["customer_id", 16]]