app/controllers/customers_controller.rb

INSERT INTO "customers" ("created_at", "email", "first_name", "last_name", "password_digest", "postcode", "street_name", "street_number", "suburb", "unit_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1
UPDATE "orders" SET "customer_id" = $1, "updated_at" = $2 WHERE "orders"."id" = 61
---
	def create
		@customer = Customer.create customer_params
		session[:customer_id] = @customer.id
		if session[:order_id]
	        order = Order.find session[:order_id]
	        order.customer_id = customer.id
	        order.save

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1
---
	def show
		@customer = Customer.find params[:id]

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@customer = Customer.find params[:id]

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "customers" SET "last_name" = ?, "postcode" = ?, "street_number" = ?, "suburb" = ?, "unit_number" = ?, "updated_at" = ? WHERE "customers"."id" = 2  [["last_name", "Banana"], ["postcode", "2000"], ["street_number", "2"], ["suburb", "Sydney"], ["unit_number", "1"], ["updated_at", "2014-10-07 06:13:53.228981"]]
---
	def update
		@customer = Customer.find params[:id]
		@customer.update customer_params