app/controllers/order_controller.rb

	def new
		@order = Order.new
		@product = Product.find params[:product_id]
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1

	def create
		@order = Order.create order_params
		@order.update :status => 'pending'
		product = Product.find params[:product_id]
		@order.products << product
		session[:order_id] = @order.id
		if  @current_customer.present?
			@order.update :customer_id => @current_customer.id
---
INSERT INTO "orders" ("bottom_colour", "bottom_size", "created_at", "top_colour", "top_size", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = 52
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1
UPDATE "orders" SET "customer_id" = $1, "updated_at" = $2 WHERE "orders"."id" = 52

	def checkout
		@customer = @current_customer
		@order = Order.find session[:order_id]
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1

	def complete
		@customer = Customer.find session[:customer_id]
		@order = Order.find session[:order_id]
		@order.update :status => 'confirmed'
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = 61