app/controllers/swimwear_controller.rb

SELECT  "products".* FROM "products"   ORDER BY "products"."id" ASC LIMIT 1
---
	def index
		@products = Product.all #retrieve all existing products from the database