ga_project_1/app/controllers/order_controller.rb

INSERT INTO "orders" ("bottom_colour", "bottom_size", "created_at", "top_colour", "top_size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@order = Order.create order_params