ga_project_1/app/controllers/session_controller.rb

SELECT  "customers".* FROM "customers"  WHERE "customers"."email" = 'fabian@fabianstein.com'  ORDER BY "customers"."id" ASC LIMIT 1
---
  def create
    customer = Customer.where(:email => params[:email]).first